In [5]:
import pandas as pd

In [6]:
si = {'ID' : [i for i in range(201, 221)],
      'Gender' : ['M', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'M',
                   'F', 'F', 'F', 'F', 'F', 'M', 'F', 'F', 'M', 'M'],
      'Class' : ['D', 'E', 'A', 'B', 'B', 'C', 'E', 'C', 'D', 'E',
                 'E', 'D', 'C', 'B', 'A', 'A', 'C', 'D', 'B', 'A'],     
      'Score' : [85, 78, 84, 79, 80, 99, 86, 91, 83, 87,
                 93, 75, 77, 94, 72, 74, 65, 95, 100, 76],
      'Country' : ['Japan', 'USA', 'China', 'China', 'USA', 'Japan', 'USA', 'USA', 'Korea', 'Korea',
                   'Korea', 'China', 'English', 'Korea', 'Korea', 'Korea', 'Japan', 'USA', 'Korea', 'Japan'],
      'City_Id' : [15, 12, 8, 17, 19, 16, 20, 20, 13, 14, 10, 8, 9, 14, 11, 12, 10, 11, 10, 15]
      }

si = pd.DataFrame(si)

In [10]:
si.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
ID         20 non-null int64
Gender     20 non-null object
Class      20 non-null object
Score      20 non-null int64
Country    20 non-null object
City_Id    20 non-null int64
dtypes: int64(3), object(3)
memory usage: 1.0+ KB

#### 기본 describe()

In [11]:
si.describe()

              ID       Score    City_Id
count   20.00000   20.000000  20.000000
mean   210.50000   83.650000  13.200000
std      5.91608    9.516053   3.778053
min    201.00000   65.000000   8.000000
25%    205.75000   76.750000  10.000000
50%    210.50000   83.500000  12.500000
75%    215.25000   91.500000  15.250000
max    220.00000  100.000000  20.000000

#### 숫자형 변수 describe()

In [17]:
int_cols = [col for col in si if si[col].dtype == 'int64' ]
int_cols

['ID', 'Score', 'City_Id']

In [14]:
si.dtypes

ID          int64
Gender     object
Class      object
Score       int64
Country    object
City_Id     int64
dtype: object

In [16]:
si[int_cols].describe()

              ID       Score    City_Id
count   20.00000   20.000000  20.000000
mean   210.50000   83.650000  13.200000
std      5.91608    9.516053   3.778053
min    201.00000   65.000000   8.000000
25%    205.75000   76.750000  10.000000
50%    210.50000   83.500000  12.500000
75%    215.25000   91.500000  15.250000
max    220.00000  100.000000  20.000000

#### 범주형 변수 describe()

In [18]:
obj_cols = [col for col in si if si[col].dtype == 'object' ]
obj_cols

['Gender', 'Class', 'Country']

In [19]:
si.dtypes

ID          int64
Gender     object
Class      object
Score       int64
Country    object
City_Id     int64
dtype: object

In [20]:
si[obj_cols].describe()

       Gender Class Country
count      20    20      20
unique      2     5       5
top         M     E   Korea
freq       10     4       7

#### 숫자 범주 한꺼번에 보기

In [22]:
si.describe(include = 'all')

               ID Gender Class       Score Country    City_Id
count    20.00000     20    20   20.000000      20  20.000000
unique        NaN      2     5         NaN       5        NaN
top           NaN      M     E         NaN   Korea        NaN
freq          NaN     10     4         NaN       7        NaN
mean    210.50000    NaN   NaN   83.650000     NaN  13.200000
std       5.91608    NaN   NaN    9.516053     NaN   3.778053
min     201.00000    NaN   NaN   65.000000     NaN   8.000000
25%     205.75000    NaN   NaN   76.750000     NaN  10.000000
50%     210.50000    NaN   NaN   83.500000     NaN  12.500000
75%     215.25000    NaN   NaN   91.500000     NaN  15.250000
max     220.00000    NaN   NaN  100.000000     NaN  20.000000